[
  {
    "id": "police-button-esp32",
    "title": "Police Button: ESP32-C3 + Android BLE Project",
    "date": "2025-11-28",
    "description": "A physical button that connects to your phone via Bluetooth Low Energy and automatically reports police to Google Maps during active navigation. Built with ESP32-C3 and Android, solving the challenge of quick police reporting while driving.",
    "content": "## What It Does\n\nA physical button that, when pressed, automatically reports police to Google Maps during active navigation. The button connects to your phone via Bluetooth Low Energy (BLE) and triggers the police report with a single press.\n\n<video controls><source src=\"images/policeButtonDemo.mp4\" type=\"video/mp4\">Your browser does not support the video tag.</video>\n\n## The Problem It Solves\n\nWhen driving and you see police, you want to report them quickly without taking your hands off the wheel or eyes off the road. This project gives you a physical button you can press without looking.\n\n## How It Works\n\n**Hardware:**\n\n- ESP32-C3 microcontroller (cheap, ~$5)\n- Physical button (the ESP32-C3's built-in BOOT button works)\n- Powers via USB\n\n**Software:**\n\n- ESP32 firmware broadcasts as a BLE device named \"PoliceButton\"\n- Android app connects and polls the device every 200ms\n- When button is pressed, ESP32 sets a characteristic value to 0x01\n- Android app detects this and triggers Google Maps police report intent\n\n**The Flow:**\n\n1. ESP32-C3 boots up and starts advertising as \"PoliceButton\"\n2. Android app scans, finds it, and connects\n3. App polls the characteristic every 200ms\n4. User presses button → ESP32 sets value to 0x01\n5. App reads 0x01 → triggers geo.action:?act=report_police intent\n6. Google Maps (if in active navigation) receives the report\n\n## The Technical Challenge (And How We Solved It)\n\n**The Problem:** Initially used the NimBLE library for ESP32-C3. Everything seemed to work - the code was updating the characteristic value, the onRead callback was firing, Android was successfully reading the characteristic. But Android always read 0x00 no matter what the ESP32 set it to.\n\n**What We Tried:**\n\n- Simple setValue() calls - didn't work\n- Creating new value arrays to avoid pointer caching - didn't work\n- Using onRead callback to update value dynamically - didn't work\n- Multiple setValue() calls with delays - didn't work\n- Sync mechanisms - didn't work\n\n**The Root Cause:** NimBLE on ESP32-C3 has a bug where setValue() doesn't actually update the value that gets returned on read, even when called in the onRead callback. The value appears \"stuck\" at whatever it was initialized to.\n\n**The Solution:** Switched to the ESP32 BLE Arduino library (BLEDevice.h). Same code, different library - and it works perfectly. The value updates correctly, polling detects button presses, everything works.\n\n**Lesson Learned:** Sometimes the library is the problem, not your code. If something should work but doesn't, try a different implementation.\n\n## Technical Details\n\n**ESP32-C3 Code:**\n\n- Uses ESP32 BLE Arduino library (not NimBLE)\n- Monitors GPIO pins 0-10 for button presses\n- Updates characteristic value in onRead callback\n- Sets value to 0x01 on button press, resets to 0x00 after 2 seconds\n\n**Android App:**\n\n- Polls characteristic every 200ms (fast enough to catch button presses)\n- Detects value == 0x01 and triggers police report\n- Dark mode UI with night-time road background\n- Side-by-side Start/Stop buttons\n\n**BLE Setup:**\n\n- Service UUID: 0000deaf-0000-1000-8000-00805f9b34fb\n- Characteristic UUID: 0000beef-0000-1000-8000-00805f9b34fb\n- Properties: READ, WRITE, NOTIFY\n\n## Why Polling Instead of Notifications?\n\nWe tried notifications first, but they weren't reliable on Android. Polling every 200ms is fast enough (button press lasts longer than that) and more reliable. The ESP32 updates the value in the onRead callback, so each poll gets the current state.\n\n## Requirements\n\n- ESP32-C3 board\n- Android phone with Google Maps\n- Google Maps must be in active navigation mode for the report to work\n- BLE permissions on Android\n\n## The UI\n\nDark mode theme with:\n\n- Large police emoji (🚔)\n- \"REPORT THE POLICE\" text (REPORT in red, POLICE in blue)\n- Night-time road background with yellow dashed lines\n- Simple Start/Stop buttons\n- Instructions mentioning Google Maps navigation requirement\n- Help button (?) in corner\n- Copyright notice\n\n## What I Learned\n\n- BLE libraries matter - NimBLE had a bug, ESP32 BLE Arduino library worked\n- Polling can be better than notifications - More reliable, easier to debug\n- ESP32-C3 is great for BLE projects - Cheap, powerful, easy to use\n- Android BLE can be finicky - Permissions, connection handling, value caching all need careful attention\n\n## Future Improvements\n\n- Add battery-powered option (currently USB-powered)\n- Support for multiple button presses (different actions)\n- Better error handling and reconnection logic\n- Support for other navigation apps\n\n## Code\n\nThe project is open source and available on GitHub. The ESP32 code uses the ESP32 BLE Arduino library, and the Android app is a standard Kotlin/Android project.",
    "image": "images/esp32c3.png",
    "tags": ["hardware", "esp32", "android", "ble", "iot", "arduino"]
  },
  {
    "id": "paper-password-backup",
    "title": "Paper Password Backup",
    "date": "2025-11-16",
    "description": "A decorative backup for a Diceware-style password encoded in a framed QR code-style artwork. Even with all visible words, the search space remains between ten million and one hundred trillion possible combinations.",
    "content": "This framed piece is a decorative backup for a Diceware-style password. The image shown here has extra noise added so it can't be used directly.\n\nThe real version encodes two lists of Diceware words. I use a specific number that only matters to me to decide which words and in what order form my actual password.\n\nEven if someone knew this print was password-related and had every visible word, cracking it still isn't simple. They would have to guess:\n\n- which subset of the words I actually used\n- the real password length\n- the correct order\n- capitalization rules\n- spacing/symbol rules\n- and what service the password is for\n\nBecause of all that uncertainty, the search space isn't just \"all combinations of 20 words.\" It realistically lands somewhere between ten million and one hundred trillion possible word-and-format combinations — before even considering extra tweaks I might apply.\n\nSo the piece works as a memory aid for me but provides no direct, usable password to anyone else.",
    "image": "images/qr-project.png",
    "tags": ["security", "password", "art", "diceware"]
  }
]
